<?php
/**
 * @package Show Local Url Titles
 * Language strings for the Show Local Url Titles mod.
 */

$txt['ShowLocalUrlTitles_tab'] = 'Ќазвани€ локальных ссылок';
$txt['ShowLocalUrlTitles_heading'] = 'Ќастройки отображени€ локальных ссылок';
$txt['ShowLocalUrlTitles_parsebbc'] = 'ƒобавл€ть названи€ локальных ссылок при просмотре сообщений (не рекомендуетс€)';
$txt['ShowLocalUrlTitles_posting'] = 'ƒобавл€ть названи€ локальных ссылок при отправке или редактировании сообщений (рекомендуетс€)';
$txt['ShowLocalUrlTitles_autolink'] = 'јвтовставка ссылок в сообщени€х (требуетс€ дл€ создани€ автоссылок)';
$txt['ShowLocalUrlTitles_remove_re'] = '”бирать "Re:" из названий сообщений';
$txt['ShowLocalUrlTitles_parse_existing'] = ' ликните здесь дл€ обработки локальных ссылок во всех существующих сообщени€х. (¬нимание: это может зан€ть некоторое врем€! ѕредварительно создайте резервную копию базы данных!)';
$txt['ShowLocalUrlTitles_parse_existing_confirmation'] = '”верены, что хотите обработать все сообщени€ на этом форуме? \n\nЁто действие нельз€ будет отменить!\nѕредварительно создайте резервную копию базы данных!';

$txt['ShowLocalUrlTitles_parsebbc_sub'] = ' Ёта опци€ включает обработку локальных ссылок во врем€ отображени€ сообщени€. Ёто добавит лишние запросы к базе данных при просмотре каждой страницы, что снизит производительность. Ќе рекомендуетс€ включать на больших форумах где важна производительность.';
$txt['ShowLocalUrlTitles_posting_sub'] = 'Ёта опци€ включает обработку локальных ссылок во врем€ отправки или редактировани€ сообщени€. –екомендуетс€ использовать этот вариант, так как он более эффективен, чем обработка ссылок при каждом просмотре страниц.';
$txt['ShowLocalUrlTitles_autolink_sub'] = 'Ёта опци€ включает создание автоссылок при создании или редактировании сообщений.<br />јвтоссылки - это неактивные ссылки, не наход€щиес€ внутри тегов url и iurl, которые автоматически преобразуютс€ в активные.';